In [24]:
# Задание 1
# Скачайте с сайта grouplens.org...movielens/ датасет любого размера. 
# Определите какому фильму было выставлено больше всего оценок 5.0.

In [27]:
import pandas as pd
movies=pd.read_csv('movies.csv')
ratings=pd.read_csv('ratings.csv')
mov_rat = ratings.merge(movies, on='movieId', how='left')
joined[['movieId','rating','title']].head()

   movieId  rating                        title
0        1     4.0             Toy Story (1995)
1        3     4.0      Grumpier Old Men (1995)
2        6     4.0                  Heat (1995)
3       47     5.0  Seven (a.k.a. Se7en) (1995)
4       50     5.0   Usual Suspects, The (1995)

In [28]:
mov_rat_5=mov_rat[(joined ['rating']==5.0)]
result=mov_rat_5.groupby(['movieId' , 'title'])['movieId'].count()
result.sort_values(ascending=False).head(1)

movieId  title
318      Shawshank Redemption, The (1994)    153
Name: movieId, dtype: int64

In [ ]:
# Задание 2
# По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония)  
# категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [51]:
power=pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [52]:
ELL = power[(power['country']=='Estonia') | (power['country']=='Lithuania') | (power['country']=='Latvia') ]
ELL.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [53]:
ELL_fil=ELL[(ELL['category']==4) | (ELL['category']==12) | (ELL['category']==21) & (ELL['year']<2010) & (ELL['year']>2005)]
ELL_fil['quantity'].sum()

165867.0

In [54]:
# Задание 3
# Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
# Примеры страниц (необязательно брать именно эти):
# https://fortrader.org/quotes
# www.finanz.ru...om-vremeni

In [55]:
df=pd.read_html('https://fortrader.org/quotes')[1]
df.head()

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,72.62,-0.03,-0.04,NaN
1,Нефть WTI Цены на нефть WTI,70.81,0.03,0.04,NaN
2,Природный газ Цена на природный газ,3.28,-0.00,-0.03,NaN
3,Кофе,157.90,0.00,0.00,NaN
4,Кукуруза,685.20,0.20,0.03,NaN